<?php include 'inc/variables.php'; ?>
<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <title>Студент Пиріг</title>
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link rel="icon" type="image/png"  href="img/favicon.png">
    <link rel="stylesheet" href="css/style.css"/>
    <script src="js/script.js"></script>
</head>
<body>
    <?php include 'inc/header.php'; ?>
    <main class="page-main info">
        <p class="title">Особисті дані</p>
        <div class="imgCenter">
            <img
                src="<?php echo 'img/student-'.rand(1, 4).'.jpg'?>"
                width="400"
                height="400"
                style="object-fit: cover"
                alt="Моє фото"
            />
        </div>
        <p>Я <b>Пиріг Артем Вікторович</b>.</p>
        <p>Пошта: <a href="mailto: ukrain1809@gmail.com">ukrain1809@gmail.com</a></p>
        <p>Мій профіль в <a href="https://www.instagram.com/temka__18/">Instagram</a></p>
        <?php
            $profession = '
                <p class="title">ПРОФЕСIЯ</p>
                <p>Студент 3 курсу АКІТ</p>
                <h3>Короткий опис спеціальності Автоматизація та комп’ютерно-інтегровані технології:</h3>
                <p>Сучасна Hi-Tech спеціальність, яка поєднує класичну інженерну освіту в області автоматизації з поглибленим освоєнням комп’ютерних технологій і спеціального програмного забезпечення, а саме:<br/>– автоматику і інтелектуальні комп’ютерно-інтегровані технологіі;<br/>– архітектуру і програмування промислових контролерів;<br/>– 3D-моделювання та мехатроніку;<br/>– програмно-технічні комплекси АСУ ТП і технічні засоби автоматизації;<br/>– розробку програмного забезпечення в області IndustrialAutomationSystems, Industrial Internet of Things, CALS, автоматизації бізнес-процесів.</p>
                <div class="imgCenter">
                    <img src="img/akit2.jpg" width="850" alt="AKIT" />
                </div>
                <h3>Вміння і компетентності, якими буде володіти випускник за спеціальністю Автоматизація та комп’ютерно-інтегровані технології:</h3>
                <p>1. Уміння створювати і підтримувати функціонування автоматизованих систем управління виробничими процесами на базі новітніх мікропроцесорних пристроїв;<br/>2. Уміння розробляти програмне, технічне та інформаційне забезпечення автоматизованих систем управління;<br/>3. Навички управління та проектування сучасних промислово-технологічних комп’ютерних систем і мереж;<br/>4. Навички розробки програмних і програмно-апаратних комплексів широкої сфери застосування;<br/>5. Навички планування, оптимізації і інтелектуалізація виробничих процесів.</p>
                <div class="profession-row">
                    <img src="img/akit.jpg" width="400" alt="AKIT" />
                    <div>
                        <h3>Працевлаштування:</h3>Проектувальник інформаційних систем і комплексів<br/>Розробник програмного забезпечення<br/>Інженер із впровадження мікропроцесорних систем управління<br/>Інженер з організації керування виробництвом<br/>Адміністратор баз даних<br/>Керівник підрозділу комп’ютерних послуг
                    </div>
                </div>
            ';
            $hobi = '
                <p class="title">ХОБI</p>
                <p>Я люблю займатися спортом, ремонтом техніки і з користю проводити час<b>Ремонт</b>.
                <br/>
                Я вмію замінювати microUSB. Заміна microUSB Samsung j-710 </p>
                <p>Я лише місяць почав працювати в майстерні, але вже досить багато чому навчився.</p>
			    <img src="img/art.jpg" width="700" alt="Моя група" />
			    
            ';
            $info = '
                <p class="title">Iнфо</p>
                <p>
                    Народився 18 вересня 2000 року в м. Черкаси.
                    Займався дзюдо 9 років, маю велику кількість досягнень.
                    У 2017 році закінчив ЗОШ №10 м. Черкаси та вступив в
                    Черкаський національний університет імені Богдана Хмельницького в
                    навчально-науковий інститут фізики, математики та комп\'ютерно-інформаційних систем,
                    який зараз має назву ННІ інформаційних та освітніх технологій на спеціальність <br/>
                    151 Автоматизація та комп\'ютерно-інтегровані технології. <br/>
                </p>
            ';

            $content = [$profession, $hobi, $info];
            echo $content[array_rand($content)];
        ?>
    </main>
<?php include 'inc/footer.php'; ?>
</body>
</html>